Repository: polac/skyhook
Catalog: locales/*/LC_MESSAGES/secondary.po
Languages: fi

source: Passwords must match.
fi: Salasanan pitää olla sama.

source: A Blockchain wallet id is required.
fi: Blockchain lompakon id vaaditaan.

source: The main Blockchain password is required.
fi: Blockchain salasana vaaditaan.

source: Please choose a selection criteria.
fi: Ole hyvä ja valitse valinta ehto.

source: At least one pricing source is required.
fi: Vähintään yksi kurssilähde pitää määritellä.

source: Unsaved changes, discard?
fi: Tallentamattomia muutoksia, hylätäänkö?

source: Do you need more time?
fi: Tarvitsetko lisää aikaa?

source: More Time
fi: Lisää Aikaa

source: Cancel the transaction?
fi: Perutaanko transaktio?

source: Cancel:
fi: Peru:

source: Cancel
fi: Peru

source: Continue
fi: Jatka

source: Processing
fi: Käsitellään

source: Is this your address?
fi: Onko tämä osoitteesi?

source: Address Detected:
fi: Osoite Havaittu:

source: Yes
fi: Kyllä

source: No
fi: Ei

source: Invalid Email Address
fi: Epäkelpo Sähköpostiosoite

source: Specified address appears invalid.
fi: Annettu osoite näyttää olevan väärä.

source: Success
fi: Onnistui

source: Email address stored.
fi: Sähköpostiosoite tallennettu.
