Repository: polac/skyhook
Catalog: locales/*/LC_MESSAGES/skyhook.po
Languages: fi

source: System Preferences
fi: Järjestelmän Asetukset

source: Continue booting up the system for normal operation.
fi: Jatketaan käynnistystä normaalia toimintaa varten.

source: Boot
fi: Uudelleen Käynnistä

source: Change configuration settings
fi: Muuta asetuksia

source: Reconfigure
fi: Uudelleen konfiguroi

source: Project Skyhook&trade; Bitcoin ATM
fi: Project Skyhook&trade; Bitcoin Automaatti

source: Admin Login
fi: Pääkäyttäjän kirjautuminen

source: Error:
fi: Virhe:

source: Password:
fi: Salasana:

source: Cancel
fi: Peru

source: Login
fi: Kirjaudu

source: Insufficient funds, please contact the operator.
fi: Käteinen loppu, ota yhteyttä huoltoon.

source: Skyhook Bitcoin ATM
fi: Skyhook Bitcoin Automaatti

source: Invalid password supplied.
fi: Väärä salasana.

source: A working email account is required.
fi: Edellyttää toimivaa sähköpostiosoitetta.

source: Account Configuration
fi: Tilin Asetukset

source: This machine uses the Blockchain API for all transactions. A valid Blockchain User ID (GUID), Password, and Sending Bitcoin Address must be provided.
fi: Tämä laite käyttää Blockchain API:a kaikkiin transaktioihin. Tarvitset Blockchain käyttäjätunnuksen (GUID), Salasanan ja lähettävä Bitcoin-osoite pitää antaa.

source: Is this secure?
fi: Onko tämä turvallinen?

source: This data is encrypted. <br /> Additionally, it&rsquo;s only accessed for Blockchain transactions, which are secure. When the device loses power or is shut down, all decryption keys are lost.
fi: Tämä tieto on salattu. <br /> Sitä paitsi sitä käytetään ainoastaan Blockchaintransaktioihin, jotka ovat turvallisia. Kun laite sammuu, kaikki salausavaimet menetetään.

source: Exit
fi: Poistu

source: Save
fi: Tallenna

source: Password Settings
fi: Salasana Asetukset

source: Set or Change Operator Password:
fi: Aseta tai vaihda operaattorin salasanaa:

source: Confirm New Password:
fi: Varmista uusi salasana:

source: Transaction Settings
fi: Transaktio Asetukset

source: Please set your
fi: Ole hyvä ja aseta

source: limit per transaction below. Customers will see when a transaction is nearing this limit.
fi: transaktio kohtainen raja alle. Asiakas näkee kun transaktio lähenee tätä rajaa.

source: Limit: </br><i>(0=disabled)</i>
fi: Raja: </br><i>(0=pois käytöstä)</i>

source: Email Settings
fi: Sähköposti Asetukset

source: <strong>Currently only gmail is supported</strong></br> <i>An email address is required for sending customer receipts, receiving transaction logs and sending transaction errors that need to be resolved manually.</i>
fi: <strong>Tällä hetkellä ainoastaan gmail on tuettu</strong></br> <i>Sähköposti edellytetään, jotta voidaan lähettää asiakkaiden kuitteja, vastaanottaatransaktio logeja ja lähettää transaktio virheitä, jotka edellyttävät käsin tehtävää ratkaisua.</i>

source: Email Address
fi: Sähköpostiosoite

source: Email Password
fi: Sähköpostin Salasana

source: Machine Name
fi: Laitteen Nimi

source: Name your machine (a unique Machine Name is recommended)
fi: Nimeä laitteesi (yksilöivää nimeä suositellaan)

source: Blockchain Configuration
fi: Blockchain Asetukset

source: Blockchain ID (GUID)
fi: Blockchain käyttäjätunnus (GUID)

source: Blockchain Password
fi: BLockchain Salasana

source: Secondary Password (optional)
fi: Toissijainen Salasana (ei pakollinen)

source: Sending Bitcoin Address
fi: Lähettävä Bitcoin-osoite

source: Restart Machine
fi: Uudelleen Käynnistä Laite

source: Restart Services
fi: Uudelleen Käynnistä Palvelut

source: Crash Browser
fi: Crash-Selain

source: Contact Settings
fi: Yhteystieto Asetukset

source: When a price cannot be acquired a page will render with this information on it. Most of the time this will likely be a network issue.
fi: Kun hintatieto ei pystytä hakemaan näytetään sivu, jossa on tämä sisältö. Useimmiten tämä johtunee verkkoyhteyden ongelmista.

source: This is the rough equivalent of an 'out of order' sign.
fi: Tämä on alustava vastine 'poissä käytöstä'-kyltille.

source: Example:</br> <i></br> PROJECT SKYHOOK</br> support@projectskyhook.com</br> 503-489-9998</br> 3519 NE 15TH AVE, STE 350</br> PORTLAND, OR 97212</i>
fi: Esimerkki:</br> <i></br> PROJECT SKYHOOK</br> support@projectskyhook.com</br> 503-489-9998</br> 3519 NE 15TH AVE, STE 350</br> PORTLAND, OR 97212</i>

source: Pricing Settings
fi: Hinnoittelu Asetukset

source: Select pricing method:
fi: Valitse hinnoittelu tapa:

source: Single
fi: Yksittäinen

source: Highest
fi: Korkein

source: Lowest
fi: Matalin

source: <strong>Single</strong> if you only wish to consult one price source.<br> <strong>Lowest</strong>/<strong>Highest</strong> if you would like to consult multiple sources and select among them based on the chosen criteria.
fi: <strong>Yksittäinen</strong> Jos haluat käyttää ainoastaan yhtä kurssin lähdettä.<br> <strong>Matalin</strong>/<strong>Korkein</strong> Jos haluat käyttää useampaa kurssin lähdettä ja valita niiden väliltä joko matalimman tai korkeimman kurssin.

source: Source:
fi: Lähde:

source: Choose Source:
fi: Valitse Lähde:

source: Sources:
fi: Lähteet:

source: Choose Sources:
fi: Valitse Lähteet:

source: Static Price:
fi: Kiinteä Hinta:

source: Percentage Fee
fi: Prosentuaalinen Palkkio

source: Minimum Price
fi: Minimi Hinta

source: Retrieve Transaction Log (CSV format)
fi: Lataa Transaktio Logi (CSV-formaatti)

source: Send Hourly Transaction Log:
fi: Lähetä tunneittain Transaktio Logi:

source: Off
fi: Pois Päältä

source: Hourly
fi: Tunneittain

source: Send transaction log (delta)
fi: Lähetä transaktio logi (muutos)

source: Send complete transaction log
fi: Lähetä transaktio logi kokonaisuudessaan

source: Configuration saved
fi: Asetukset tallennettu

source: Redirecting to Start page in a few seconds...
fi: Uudelleen ohjataan aloitussivulle muutamassa sekunnissa...

source: Start Page
fi: Aloitussivu

source: insert bills
fi: Syötä seteleitä

source: bitcoins will be sent to:
fi: bitcoinit lähetetään osoitteeseen:

source: Do Not Insert Bills Larger than
fi: Älä syötä seteleitä, jotka ovat suurempia kuin

source: buy bitcoins
fi: osta bitcoineja

source: transaction complete
fi: Transaktio on valmis

source: Bitcoin Address:
fi: Bitcoin-osoitteeseen:

source: has been sent:
fi: on lähetetty:

source: for the price of:
fi: hintaan:

source: email me a receipt
fi: Sähköpostita kuitti

source: Invalid Email
fi: Virheellinen sähköpostiosoite

source: Email Sent
fi: Sähköposti lähetetty

source: done
fi: valmis

source: Ticket #
fi: Kuitti #

source: encountered an error while processing this transaction.
fi: tapahtui virhe käsiteltäessä tätä transaktiota.

source: Please see the attached error log for more details.
fi: Ole hyvä ja katso liitteenä oleva virhe logi.

source: Ticket ID:
fi: Kuitin tunnus:

source: Purchase Time (in UTC):
fi: Osto aika (UTC):

source: Customer's Bitcoin Address:
fi: Asiakkaan Bitcoin-osoite:

source: Currency Inserted
fi: Valuuttaa Syötetty

source: Bitcoin Price:
fi: Bitcoinin Kurssi:

source: Bitcoin Purchased:
fi: Bitcoineja Ostettu:

source: Transaction ID:
fi: Transaktion Tunniste:

source: Ticket Status:
fi: Kuitin Tila:

source: Ticket Finalized (in UTC):
fi: Kuitti Käsitelty (UTC):

source: Blockchain.info Transaction Message:
fi: Blockchain.info Transaktion Viesti:

source: Transaction Notice:
fi: Transaktion Huomautus:

source: Thank you for using the Skyhook Bitcoin ATM! Please see your transaction details below.
fi: Kiitos, että käytit Skyhook:n Bitcoin automaattia! Alla näet transaktiosi yksityiskohdat.

source: Transaction Number:
fi: Transaktion Numero:

source: Date:
fi: Päivämäärä:

source: Transaction Value:
fi: Transaktion Arvo:

source: Bitcoin Amount:
fi: Määrä Bitcoineina:

source: Transaction Link:
fi: Transaktion Linkki:

source: Project Skyhook is an open-source, community powered project and you can help. Have a comment or suggestion that can help us improve your user experience? Visit us at <a href="http://projectskyhook.com/feedback"> http://projectskyhook.com/feedback </a> and contact us!
fi: Project Skyhook on avoimen lähdekoodin, yhteisöllinen projekti ja sinä voit auttaa. Anna palautetta tai kerro ideasi, jolla voisimme parantaa käyttäjäkokemusta. Tee se osoitteessa <a href="http://projectskyhook.com/feedback"> http://projectskyhook.com/feedback </a>

source: was updated with an email address. Use this address to notify the customer as the transaction error is resolved.
fi: päivitettiin sähköpostiosoitteella. Käytä tätä osoitetta kertoaksesi asiakkaalle, että transaktiovirhe on korjattu.

source: <strong>Note:</strong> This Skyhook machine does not automatically notify the customer of status changes.
fi: <strong>Huomaa:</strong> Tämä skyhook laite ei automaattisesti ilmoita asiakkaalle tilamuutoksista.

source: Customer's Email Address:
fi: Asiakkaan Sähköpostiosoite:

source: Error information reproduced below - technical information attached
fi: Virhetieto uudelleen esitettynä alla - tekninen tieto liitteenä

source: A trans&shy;act&shy;ion error has occured
fi: Transaktio virhe on tapahtunut

source: notify me
fi: ilmoita minulle

source: no thanks
fi: ei kiitos

source: This transaction has been logged and the operator notified for manual processing.
fi: Tämä transaktio on tallennettu ja ylläpitäjää on tiedotettu, jotta ongelma voitaisiin ratkaista.

source: Please enter your email address so that the operator may notify you when this issue is resolved.
fi: Ole hyvä ja syötä sähköpostiosoitteesi, jotta ylläpitäjä voi ilmoittaa sinulle kun ongelma on ratkaistu.

source: Network Unreachable
fi: Verkkoyhteydessä Ongelmia

source: If the problem persists, please contact the operator.
fi: Jos ongelma pitkittyy, ota yhteyttä ylläpitäjään.

source: : Transaction Log
fi: : Transaktion Logi

source: See attached for transaction log.
fi: Transaktion logi liitteenä.

source: There have been no transactions since the last email.
fi: Ei transaktioita sitten viime sähköpostin.

source: A choice must be made between Single\Highest\Lowest
fi: Pitää valita joku seuraavista Yksittäinen\Korkein\Matalin

source: If Single is chosen, exactly 1 pricing source must be chosen.
fi: Jos Yksittäinen on valittu, tasan yksi kurssilähde pitää valita.

source: At least one pricing source must be chosen.
fi: Vähintään yksi kurssilähde pitää valita.

source: Unrecognized pricing source:
fi: Tuntematon kurssilähde:

source: When using static price a value is required.
fi: Käytetään kiinteää hintaa on annetta jokin arvo.

source: Static price value must be numeric.
fi: Staattinen kurssi pitää olla numero.

source: Unrecognized pricing modifier:
fi: Tuntematon kurssin muunnin:

source: Value must be numeric for:
fi: Arvon pitää olla numeerinen:

source: A valid Blockchain.info wallet id is required.
fi: Toimiva Blockchain.info lompakko ID edellytetään.

source: Your respective Blockchain.info password is required.
fi: Blockchain.info lompakon salasanaa edellytetään.

source: An address controlled by your Blockchain.info wallet is required to send from.
fi: Osoite, joka on Blockchain.info lompakon hallussa on annettava, jotta varoja voidaan lähettää.

source: A valid Bitcoin address is required.
fi: Toimiva Bitcoin osoite pitää antaa.

source: A valid email address is required.
fi: Toimiva sähköpostiosoite pitää antaa.

source: Email address entered is not valid.
fi: Syötetty sähköpostiosoite ei kelpaa.

source: Email password is required.
fi: Sähköpostin salasana edellytetään.

source: Minimum password length is 5 characters.
fi: Minimi salasanan pituus on 5 merkkiä.

source: Admin passwords must match
fi: Pääkäyttäjän salasanan pitää olla sama

source: Maximum transaction value must be a positive integer.
fi: Maksimi transaktion määrä pitää olla positiivinen kokonaisluku.

source: Unknown format encountered:
fi: Tuntematon formaatti havaittu:

source: Unknown format encountered when attempmting to retreive balance:
fi: Tuntematon formaatti havaittu yritettäessä hakea saldoa:

source: Device Commands
fi: Laitteen Käskyt
